api/app/graphql/mutations/create_rss_crawl_request.rb

INSERT INTO `crawl_requests` (`job_type`, `rules`, `schedule_type`, `created_at`, `updated_at`) VALUES ('rss', '{\"rss_urls\":[\"https://news.walkerplus.com/rss/sttv7.xml\"],\"tag_name\":\"item\",\"link_node_name\":\"link\",\"url_replace_pattern\":null,\"replace_new_string\":null}', 'now', '2020-06-01 12:58:28', '2020-06-01 12:58:28')
---
    def resolve(**args)
      request = CrawlRequest.create(
        job_type: args[:job_type],
        rules: JSON.generate(
          { start_urls: args[:start_urls],
            tag_name: args[:tag_name],
            link_node_name: args[:link_node_name],
            url_replace_pattern: args[:url_replace_pattern],
            replace_new_string: args[:replace_new_string],
            user_agent: args[:user_agent],
            login_url: args[:login_url],
            login_name: args[:login_name],
            login_password: args[:login_password],
            login_name_attr: args[:login_name_attr],
            login_pass_attr: args[:login_pass_attr],
          }
        ),
        schedule_type: args[:schedule_type],
        interval_hours: args[:interval_hours]
      )