api/app/graphql/mutations/schedule_job.rb

SELECT  `crawl_requests`.* FROM `crawl_requests` WHERE `crawl_requests`.`id` = 3 LIMIT 1
UPDATE `crawl_requests` SET `job_id` = '7f144f56-d593-48cb-a2d2-e2b18711ca5a', `updated_at` = '2020-06-01 23:57:45' WHERE `crawl_requests`.`id` = 15
---
    def resolve(**args)
      job = CrawlRequest.find(args[:request_id])

      client = HTTPClient.new
      url = 'http://scrapy:7654/schedule-job.json'

      # dryrunの時は即時実行にする
      is_dryrun = args[:is_dryrun]
      schedule = if is_dryrun || job.schedule_type == 'now'
                   'now'
                 elsif job.schedule_type == 'intervals'
                   "every #{job.interval_hours} hours"
                 else
                  # TODO: 例外にする
                   'now'
                 end

      body = {'project'=> 'crawling',
              'spider' => "#{job.job_type}_crawl",
              'when' => "#{schedule}",
              'payload' => "{\"req_id\": #{job.id}, \"is_dryrun\": #{is_dryrun}}"}
      response = client.post(url, body)

      resj = JSON.parse(response.body)
      if resj['status'] == 'ok' && job.schedule_type == 'intervals'
          job.update(job_id: resj['identifier'])